In [4]:
%matplotlib inline
import pandas as pd

In [5]:
from IPython.core.display import HTML
#css = open('style-table.css').read() + open('style-notebook.css').read()
#HTML('<style>{}</style>'.format(css))

In [6]:
titles = pd.read_csv('C:/Users/kobalaji/Desktop/LetsUpgrade AI-ML/Day 16/titles.csv')
titles.head(10)

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008
5            Tight Spot  1955
6        Chocolate (II)  2011
7      Wang de Shengyan  2012
8       Bao dao mei ren  1956
9   A Man Called Nereus  2012

### How many movies are listed in the titles dataframe?

In [7]:
print("Total Movies listed are :",titles['title'].count())

Total Movies listed are : 244914

### What are the earliest two films listed in the titles dataframe?

In [28]:
titles.sort_values(by=['year']).tail(2)

                           title  year
183018  The Zero Century: Maetel  2026
242196                 100 Years  2115

In [29]:
titles.sort_values(by=['year']).head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [46]:
df2 = titles[titles['title']=="Hamlet"]
df2.sort_values(by = ['year'])

         title  year
52521   Hamlet  1910
198234  Hamlet  1911
39916   Hamlet  1913
10637   Hamlet  1921
101728  Hamlet  1948
172640  Hamlet  1954
161324  Hamlet  1964
67406   Hamlet  1969
122827  Hamlet  1973
133921  Hamlet  1976
82130   Hamlet  1987
192142  Hamlet  1990
178222  Hamlet  1996
62000   Hamlet  2000
189093  Hamlet  2009
173033  Hamlet  2011
202025  Hamlet  2014
154029  Hamlet  2015
88065   Hamlet  2016
6422    Hamlet  2017

In [38]:
print('Movies with title "Hamlet":',df2['title'].count())

Movies with title "Hamlet": 20

### How many movies are titled "North by Northwest"?

In [39]:
df3 = titles[titles['title']=="North by Northwest"]

In [40]:
print('Movies with title "Hamlet":',df3['title'].count())

Movies with title "Hamlet": 1

### When was the first movie titled "Hamlet" made?

In [50]:
df2 = titles[titles['title']=="Hamlet"]
df2 = df2.sort_values(by=['year'])
print('first movie titled "Hamlet" made:',df2.head(1))

first movie titled "Hamlet" made:         title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [51]:
df2 = titles[titles['title']=="Treasure Island"]
print('all of the "Treasure Island" movies from earliest to most recent \n:',df2.sort_values(by=['year']))

all of the "Treasure Island" movies from earliest to most recent
:                   title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [59]:
df4 = titles[titles['year']==1950]
print('# movies were made in the year 1950 :',df4['title'].count())

# movies were made in the year 1950 : 1113

### How many movies were made in the year 1960?

In [60]:
df4 = titles[titles['year']==1960]
print('# movies were made in the year 1960 :',df4['title'].count())

# movies were made in the year 1960 : 1549

### How many movies were made from 1950 through 1959?

In [65]:
df4 = titles[(titles['year']>=1950) & (titles['year']<=1959)]
print('# movies were made from 1950 through 1959 :',df4['title'].count())

# movies were made from 1950 through 1959 : 12934

### In what years has a movie titled "Batman" been released?

In [69]:
df4 = titles[(titles['title']== "Batman")]
df4

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

### But how many roles in the movie "Inception" did receive an "n" value?

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?